# Python Pandas Data Structure

The Pandas provides two data structures for processing the data, i.e., Series and DataFrame.The Pandas Series can be defined as a one-dimensional array that is capable of storing various data types.A Series cannot contain multiple columns

In [46]:
#Series

import pandas as pd
import numpy as np
info = np.array(['P','a','n','d','a','s'])  
a = pd.Series(info)
print(a)

0    P
1    a
2    n
3    d
4    a
5    s
dtype: object

In [47]:
#DataFrame
import pandas as pd  
# a list of strings  
x = ['Python', 'Pandas']  
  
# Calling DataFrame constructor on list  
df = pd.DataFrame(x)  
print(df)

        0
0  Python
1  Pandas

# Creating a Series using inputs:Array, Dict, Scalar value

In [48]:
a = pd.Series(4, index = [0,1,2,3])
print(a)

0    4
1    4
2    4
3    4
dtype: int64

# Series has the following parameter: - data, index, dtype, copy

In [49]:
x = pd.Series()  
print (x)

Series([], dtype: float64)

<ipython-input-49-2da0348122c1>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  x = pd.Series()

# Pandas Series map :-

The main task of map() is used to map the values from two series that have a common column.

Series.map(arg, na_action=None)

In [50]:
a = pd.Series(['Java', 'C', 'C++' , np.nan])
#a.map({'C': 'Core'})  
a.map('I like {}'.format)  
#a.map('I like {}'.format, na_action='ignore')

0    I like Java
1       I like C
2     I like C++
3     I like nan
dtype: object

In [51]:
info = np.array([1,1,1,1,1,1])  
a = pd.Series(info)
a.std()

0.0

In [52]:
#Pandas Series.std()
info = {  
    'Name':['Parker','Smith','John','William'],  
   'sub1_Marks':[52,38,42,37],  
   'sub2_Marks':[41,35,29,36]}   
data = pd.DataFrame(info)  
data  
# standard deviation of the dataframe  
data.std()

sub1_Marks    6.849574
sub2_Marks    4.924429
dtype: float64

Series can only contain a single list with a particular index, whereas the DataFrame is a combination of more than one series that can analyze the data.

# to_frame():-

In [53]:
a = pd.Series([1,2,3,4,3,1], name='vals')
print(a)

0    1
1    2
2    3
3    4
4    3
5    1
Name: vals, dtype: int64

In [54]:
print(a.to_frame())

   vals
0     1
1     2
2     3
3     4
4     3
5     1

In [55]:
print(a.unique())

[1 2 3 4]

In [56]:
a.value_counts(normalize=False, sort=True, ascending=False, bins=None, dropna=True)

1    2
3    2
2    1
4    1
Name: vals, dtype: int64

In [57]:
a.value_counts()

1    2
3    2
2    1
4    1
Name: vals, dtype: int64

In [58]:
a.value_counts(sort=True)

1    2
3    2
2    1
4    1
Name: vals, dtype: int64

In [59]:
a.value_counts(normalize=True)

1    0.333333
3    0.333333
2    0.166667
4    0.166667
Name: vals, dtype: float64

# Data Frame:-

Pandas DataFrame is a widely used data structure which works with a two-dimensional array with labeled axes (rows and columns

In [60]:
x = ['Python', 'Pandas']  
print(pd.DataFrame(x))

        0
0  Python
1  Pandas

In [61]:
info = {'one' : pd.Series([1, 5, 3, 4, 5, 2], index=['a', 'b', 'c', 'd', 'e', 'f']),  
   'two' : pd.Series([11, 2, 3, 4, 5, 6, 7, 8], index=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])}  
  
d1 = pd.DataFrame(info)  
print (d1)

   one  two
a  1.0   11
b  5.0    2
c  3.0    3
d  4.0    4
e  5.0    5
f  2.0    6
g  NaN    7
h  NaN    8

In [62]:
#d1.pop('one')

In [63]:
d1.loc['b']

one    5.0
two    2.0
Name: b, dtype: float64

In [64]:
d1[2:5]

   one  two
c  3.0    3
d  4.0    4
e  5.0    5

In [65]:
d = pd.DataFrame([[7, 8], [9, 10]], columns = ['x','y'])  
d2 = pd.DataFrame([[11, 12], [13, 14]], columns = ['x','y'])  
d = d.append(d2)  
print (d)

    x   y
0   7   8
1   9  10
0  11  12
1  13  14

In [66]:
d.drop(0)

    x   y
1   9  10
1  13  14

# DataFrame.append()

In [71]:
# Create first Dataframe using dictionary   
info1 = pd.DataFrame({"x":[25,15,12,19],   
                    "y":[47, 24, 17, 29]})     
# Create second Dataframe using dictionary   
info2 = pd.DataFrame({"x":[25, 15, 12],   
                    "y":[47, 24, 17],    
                    "z":[38, 12, 45]})   
# append info2 at end in info1   
info1.append(info2, ignore_index = True)

    x   y     z
0  25  47   NaN
1  15  24   NaN
2  12  17   NaN
3  19  29   NaN
4  25  47  38.0
5  15  24  12.0
6  12  17  45.0

In [73]:
info = pd.DataFrame([[2, 7]] * 4, columns=['P', 'Q'])  
info

   P  Q
0  2  7
1  2  7
2  2  7
3  2  7

In [74]:
info.apply(np.sqrt)

          P         Q
0  1.414214  2.645751
1  1.414214  2.645751
2  1.414214  2.645751
3  1.414214  2.645751

# DataFrame.apply()

In [76]:
info.apply(np.sum, axis=0)

P     8
Q    28
dtype: int64

In [77]:
info.apply(lambda x: [1, 2], axis=1)

0    [1, 2]
1    [1, 2]
2    [1, 2]
3    [1, 2]
dtype: object

In [78]:
info.apply(lambda x: [1, 2], axis=1, result_type='expand')

   0  1
0  1  2
1  1  2
2  1  2
3  1  2

In [79]:
info.apply(lambda x: pd.Series([1, 2], index=['foo', 'bar']), axis=1)

   foo  bar
0    1    2
1    1    2
2    1    2
3    1    2

In [80]:
info.apply(lambda x: [1, 2], axis=1, result_type='broadcast')

   P  Q
0  1  2
1  1  2
2  1  2
3  1  2

In [81]:
info=pd.DataFrame([[1,5,7],[10,12,15],[18,21,24],[np.nan,np.nan,np.nan]],columns=['X','Y','Z'])  
info

      X     Y     Z
0   1.0   5.0   7.0
1  10.0  12.0  15.0
2  18.0  21.0  24.0
3   NaN   NaN   NaN

In [82]:
info.agg(['sum','min'])

        X     Y     Z
sum  29.0  38.0  46.0
min   1.0   5.0   7.0

# DataFrame.assign()

In [83]:
info = pd.DataFrame()  
  
# Create a column  
info['ID'] = [101, 102, 103]  
  
# View the dataframe  
info  
# Assign a new column to dataframe called 'age'   
info.assign(Name = ['Smith', 'Parker', 'John'])

    ID    Name
0  101   Smith
1  102  Parker
2  103    John